# Ian Schlierf
## Week 13 - 11/19/2020
### Python Pandas Grouping

In [1]:
import numpy as np

from pandas import Series, DataFrame
import pandas as pd

In [3]:
df = DataFrame({'city':['Alma','Brian Head','Fox Park','Lake Mary'],
               'altitude':[10355,9800,9062,8966]})

df

         city  altitude
0        Alma     10355
1  Brian Head      9800
2    Fox Park      9062
3   Lake Mary      8966

In [9]:
st_map={'Alma':'CO','Brian Head':'UT','Fox Park':'WY','Lake Mary':'CA'}
st_map

{'Alma': 'CO', 'Brian Head': 'UT', 'Fox Park': 'WY', 'Lake Mary': 'CA'}

In [10]:
df['state'] = df['city'].map(st_map)

In [11]:
df

         city  altitude state
0        Alma     10355    CO
1  Brian Head      9800    UT
2    Fox Park      9062    WY
3   Lake Mary      8966    CA

In [18]:
#apply 
def meter(x):
    return x / 3.3808

In [19]:
df['altitude'] = df['altitude'].apply(meter)

In [20]:
df

         city    altitude state
0        Alma  276.141314    CO
1  Brian Head  261.340887    UT
2    Fox Park  241.660318    WY
3   Lake Mary  239.100244    CA

In [21]:
df = DataFrame(np.random.randn(4,3), columns=list('bde'),
              index=['UT','OH','TX','OR'])

df

           b         d         e
UT -0.835722  0.791911 -0.460066
OH  0.525749 -0.395622 -0.032862
TX -0.708751 -0.762197 -1.598725
OR -1.132006 -0.023535 -1.035684

In [22]:
def dif(x):
    return x.max() - x.min()

In [23]:
df.apply(dif)

b    1.657755
d    1.554108
e    1.565863
dtype: float64

In [24]:
df.apply(dif, axis = 1)

UT    1.627633
OH    0.921371
TX    0.889974
OR    1.108471
dtype: float64

In [26]:
df.apply(pd.value_counts).fillna(0)

             b    d    e
-1.598725  0.0  0.0  1.0
-1.132006  1.0  0.0  0.0
-1.035684  0.0  0.0  1.0
-0.835722  1.0  0.0  0.0
-0.762197  0.0  1.0  0.0
-0.708751  1.0  0.0  0.0
-0.460066  0.0  0.0  1.0
-0.395622  0.0  1.0  0.0
-0.032862  0.0  0.0  1.0
-0.023535  0.0  1.0  0.0
 0.525749  1.0  0.0  0.0
 0.791911  0.0  1.0  0.0

In [27]:
#group by
df = DataFrame({'k1':['a','a','b','b','c'],
               'k2':['one','two','one','two','one'],
               'dataset1':np.random.randn(5),
               'dataset2':np.random.randn(5)})

df

  k1   k2  dataset1  dataset2
0  a  one  0.240753 -0.514267
1  a  two  0.222338 -0.342571
2  b  one -0.538955  0.316710
3  b  two  1.807563 -2.661593
4  c  one -0.353067  0.286542

In [28]:
df.groupby('k1').count()

    k2  dataset1  dataset2
k1
a    2         2         2
b    2         2         2
c    1         1         1

In [29]:
df.groupby('k1').size()

k1
a    2
b    2
c    1
dtype: int64

In [31]:
df.groupby(['k1','k2']).count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

In [32]:
df

  k1   k2  dataset1  dataset2
0  a  one  0.240753 -0.514267
1  a  two  0.222338 -0.342571
2  b  one -0.538955  0.316710
3  b  two  1.807563 -2.661593
4  c  one -0.353067  0.286542

In [35]:
df['dataset1'].groupby(df['k1']).mean()

k1
a    0.231546
b    0.634304
c   -0.353067
Name: dataset1, dtype: float64